blasisus/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          55;
        startFace       4850;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          45;
        startFace       4905;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          45;
        startFace       4950;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          35;
        startFace       4995;
    }
    symmBound
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       5030;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4950;
        startFace       5050;
    }
)

// ************************************************************************* //
